#### Terraform Plan 📖

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.cloud_trail.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.cloud_trail.aws_cloudtrail.main will be created
  + resource "aws_cloudtrail" "main" {
      + arn                           = (known after apply)
      + cloud_watch_logs_group_arn    = (known after apply)
      + cloud_watch_logs_role_arn     = (known after apply)
      + enable_log_file_validation    = true
      + enable_logging                = true
      + home_region                   = (known after apply)
      + id                            = (known after apply)
      + include_global_service_events = true
      + is_multi_region_trail         = false
      + is_organization_trail         = false
      + name                          = "Prakash-cloudtrail"
      + s3_bucket_name                = "prakash-cloudtrail-logs-bucket"
      + sns_topic_arn                 = (known after apply)
      + tags                          = {
          + "Environment" = "dev"
          + "Owner"       = "dev-team"
          + "Project"     = "aws_cloudtrail_event"
        }
      + tags_all                      = {
          + "Environment" = "dev"
          + "Owner"       = "dev-team"
          + "Project"     = "aws_cloudtrail_event"
        }

      + event_selector {
          + include_management_events = true
          + read_write_type           = "All"
        }
    }

  # module.cloud_trail.aws_iam_policy.cloudtrail_policy will be created
  + resource "aws_iam_policy" "cloudtrail_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for CloudTrail to log to S3 and CloudWatch"
      + id               = (known after apply)
      + name             = "CloudTrailLoggingPolicy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.cloud_trail.aws_iam_role.cloudtrail_role will be created
  + resource "aws_iam_role" "cloudtrail_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudtrail.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "CloudTrailRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "Owner"       = "dev-team"
          + "Project"     = "aws_cloudtrail_event"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Owner"       = "dev-team"
          + "Project"     = "aws_cloudtrail_event"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cloud_trail.aws_iam_role_policy_attachment.cloudtrail_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "cloudtrail_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "CloudTrailRole"
    }

  # module.cloud_watch.aws_cloudwatch_log_group.cloudtrail_log_group will be created
  + resource "aws_cloudwatch_log_group" "cloudtrail_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/cloudtrail/Prakash-cloudtrail"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.cloud_watch.aws_cloudwatch_log_metric_filter.login_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "login_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/cloudtrail/Prakash-cloudtrail"
      + name           = "prakash-login"
      + pattern        = "{ $.eventName = \"ConsoleLogin\" }"

      + metric_transformation {
          + name      = "ConsoleLoginEventCount"
          + namespace = "CloudTrailMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.cloud_watch.aws_cloudwatch_metric_alarm.login_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "login_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Triggers on AWS Console login attempts"
      + alarm_name                            = "ConsoleLoginAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ConsoleLoginEventCount"
      + namespace                             = "CloudTrailMetrics"
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Environment" = "dev"
          + "Owner"       = "dev-team"
          + "Project"     = "aws_cloudtrail_event"
        }...
```